app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "davante.adams@greenbaypackers.com"], ["updated_at", "2020-03-11 02:18:51.230216"], ["id", 3]]
---
    def update
        user = User.find(params[:id])
        if user.update_attributes(user_params)